---
kind: method
id: M:Autodesk.Revit.DB.View.CanModifyViewDiscipline
zh: 视图
source: html/12be51e4-a98a-a1b9-cd20-0a1483e4ecf8.htm
---
# Autodesk.Revit.DB.View.CanModifyViewDiscipline Method

**中文**: 视图

Indicates if the View Discipline can be modified

## Syntax (C#)
```csharp
public bool CanModifyViewDiscipline()
```

## Returns
True if View Discipline can be modified